{
  "backend/main.mo": "Main Motoko actor implementing trade analysis backend with user profiles, trade calculations (position size, risk/reward ratio), trade history storage per user, and role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting implemented logging, validation, error recovery, and error display improvements for the market data fetch pipeline across frontend components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing their purpose, key functionality, and recent changes related to market data fetching, error handling, and user interactions.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes optimized for a trading tool aesthetic.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React component orchestrating authentication, user profile setup, trade analysis form with live market data fetching, CSV upload integration, trade history tabs, comprehensive error handling with specific messages for rate limits/timeouts/network issues, and optional diagnostic panel in debug mode.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states. Clears the query cache on logout and handles authentication errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal dialog that prompts authenticated users to enter their name for profile setup. Uses the useSaveCallerUserProfile hook and prevents closing until a name is provided.",
  "frontend/src/components/CsvUploadPanel.tsx": "React component for uploading CSV files with historical price data, parsing them, computing technical indicators, and optionally invoking a callback with PricePoint-formatted data for form auto-population.",
  "frontend/src/components/DiagnosticPanel.tsx": "A collapsible debug panel component that displays market data diagnostics including last request/response details, cache statistics, and retry history. Uses shadcn/ui components and accepts DiagnosticData as props.",
  "frontend/src/components/DisclaimerGate.tsx": "A modal dialog component that displays a trading disclaimer on first visit, requiring users to check a box and acknowledge educational purpose, risk warnings, and no-guarantee statements before accessing the app. Uses session storage to track acknowledgment.",
  "frontend/src/components/history/HistoryDetail.tsx": "Displays detailed view of a single trade analysis including input parameters, calculated results, potential profit/loss, and risk-reward ratio. Provides a back button to return to the history list.",
  "frontend/src/components/history/HistoryPanel.tsx": "Displays a list of saved trade analyses with loading, error, and empty states. Allows selecting individual trades to view details via HistoryDetail component.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance, handling both authenticated and anonymous modes. Initializes access control with admin token and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMarketData.ts": "React hook for managing market data fetch state with retry logic, cooldown timers, rate limit handling, and diagnostic support for debugging.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating queries are organized in feature-specific hooks elsewhere.",
  "frontend/src/hooks/useTradeAnalysis.ts": "React Query mutation hook for analyzing trades by calling the backend actor with trade parameters (ticker, entry/stop/take-profit prices, risk amount).",
  "frontend/src/hooks/useTradeHistory.ts": "React Query hooks for fetching trade history list and individual trades by ID from the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the current user's profile via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using HSL color space.",
  "frontend/src/lib/csv/parsePriceCsv.ts": "CSV parser for price data that extracts date, OHLCV fields, validates data, sorts by date, and returns parsed data with error messages.",
  "frontend/src/lib/indicators.ts": "Technical indicator calculations including SMA, support/resistance levels from price data arrays or market data price points.",
  "frontend/src/lib/marketData/config.ts": "Configuration for Alpha Vantage market data API including base URL, rate limits, demo API key, and validation utilities.",
  "frontend/src/lib/marketData/deriveTradeInputs.ts": "Derives default trade input values (entry, stop-loss, take-profit) from market data and technical indicators using support/resistance or percentage-based fallbacks.",
  "frontend/src/lib/marketData/fetchMarketData.ts": "Fetches intraday market data from Alpha Vantage API with validation, timeout handling, and error detection for rate limits, invalid tickers, and API errors. Returns structured MarketDataResult or MarketDataError with parsed price points.",
  "frontend/src/lib/marketData/marketDataClient.ts": "Client wrapper for market data fetching with in-memory caching (60s TTL), request de-duplication, automatic retry with exponential backoff for rate limits, and diagnostic tracking. Enforces minimum request intervals per ticker.",
  "frontend/src/lib/marketData/marketDataPolicy.ts": "Defines centralized policy constants for market data: cache TTL (60s), request spacing (5s), retry limits (3 attempts), and exponential backoff delays (10-60s). Includes ticker normalization and backoff calculation utilities.",
  "frontend/src/lib/marketData/types.ts": "TypeScript type definitions for market data including PricePoint, MarketDataResult with price history, and MarketDataError with error codes for rate limits, invalid tickers, and other failure modes.",
  "frontend/src/lib/session.ts": "Manages disclaimer acknowledgment state in sessionStorage with getter and setter functions that handle storage unavailability gracefully.",
  "frontend/src/lib/tradeMath.ts": "Provides trade calculation utilities for potential profit/loss based on entry, take-profit, and stop-loss prices, plus currency and percentage formatting functions.",
  "frontend/src/lib/urlParams.ts": "Simple utilities to read and check URL query parameters from the browser's location search string.",
  "frontend/src/lib/validation.ts": "Input validation functions for required fields and numeric inputs with optional positive-value enforcement, returning error messages or null.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities supporting hash-based routing, sessionStorage persistence, and secure parameter extraction/clearing from URLs. Includes functions to store, retrieve, and remove parameters from both URL and session.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, container settings, extended theme with animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking for an HTML5 stock analysis web app that fetches live market data by ticker and proposes trade setups (entry, stop loss, take profit). Currently experiencing market data API rate-limiting and fetch failures requiring investigation and mitigation."
}