{
  "backend/main.mo": "Motoko canister implementing user profiles, permission checks, trade analysis calculations, and per-user trade history storage.",
  "feature_evidence.json": "Feature evidence report mapping market‑data related features to the frontend files, components, and tests involved.",
  "frontend-file-summaries.txt": "Lookup file providing short descriptions of all frontend modules and their responsibilities.",
  "frontend/index.css": "Tailwind base stylesheet defining light and dark theme color tokens and global styling rules.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication, live market data, trade analysis form logic, and UI layout with tabs and indicators.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that logs users in or out via Internet Identity, handling login state and errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for entering and saving a user's name during initial profile setup.",
  "frontend/src/components/CsvUploadPanel.tsx": "Component for uploading and parsing historical price CSVs, computing indicators, and reporting success or errors.",
  "frontend/src/components/DisclaimerGate.tsx": "Modal gate that checks and records whether the user has acknowledged a disclaimer before proceeding.",
  "frontend/src/components/history/HistoryDetail.tsx": "Displays detailed information for a selected trade analysis, including inputs and computed results.",
  "frontend/src/components/history/HistoryPanel.tsx": "Fetches and displays the user's trade analysis history with loading, error, empty, and detail views.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useMarketData.ts": "React hook managing market data fetch state with cooldown, retries, and rate‑limit handling.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for organizing query hooks.",
  "frontend/src/hooks/useTradeAnalysis.ts": "Mutation hook that sends trade analysis requests and invalidates trade history on success.",
  "frontend/src/hooks/useTradeHistory.ts": "Query hooks for fetching trade history and individual trades using an actor backend.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and save the current user's profile with query invalidation.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/src/lib/csv/parsePriceCsv.ts": "Parses a price CSV into structured price data with validation and error collection.",
  "frontend/src/lib/indicators.ts": "Computes SMA, support, resistance, and indicator summaries from price data.",
  "frontend/src/lib/marketData/config.ts": "Central config for market data provider including API settings and rate limits.",
  "frontend/src/lib/marketData/deriveTradeInputs.ts": "Generates default trade inputs from market data and indicators with fallback rules.",
  "frontend/src/lib/marketData/fetchMarketData.ts": "Fetches and parses Alpha Vantage market data with validation and rate‑limit detection.",
  "frontend/src/lib/marketData/marketDataClient.ts": "Client wrapper adding caching, de‑duplication, spacing, and automatic retry for market data fetches.",
  "frontend/src/lib/marketData/marketDataPolicy.ts": "Defines cache TTL, request spacing, retry/backoff limits, and helpers for normalizing tickers and computing backoff delays.",
  "frontend/src/lib/marketData/types.ts": "Contains TypeScript interfaces for price points, market data results, and standardized error structures.",
  "frontend/src/lib/session.ts": "Provides functions to read/write a sessionStorage flag tracking disclaimer acknowledgment.",
  "frontend/src/lib/tradeMath.ts": "Implements basic profit/loss calculations and formatting helpers for currency and percentages.",
  "frontend/src/lib/validation.ts": "Provides simple input validation utilities for required fields and numeric inputs.",
  "frontend/src/main.tsx": "App entry point configuring React, react-query, and the Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theming, colors, typography, animations, and plugins.",
  "project_state.json": "Describes project state, requirements, issues, and architectural notes for building a live market‑data‑driven trading analysis app."
}