{
  "backend/main.mo": "Motoko canister managing user profiles, permission checks, trade analyses, and per-user trade history with timestamp ordering.",
  "feature_evidence.json": "Feature evidence report mapping planned features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme variables and layout defaults.",
  "frontend/index.html": "HTML entry point that loads the React application into the root element.",
  "frontend/src/App.tsx": "Main React component handling authentication, live market data, derived trade inputs, validation, and running trade analyses.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with status handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for entering and saving a user's name with validation and error display.",
  "frontend/src/components/CsvUploadPanel.tsx": "CSV upload component that parses price data, computes indicators, and reports status or errors.",
  "frontend/src/components/DisclaimerGate.tsx": "Displays a modal disclaimer that must be acknowledged, storing acceptance in session and controlling access flow.",
  "frontend/src/components/history/HistoryDetail.tsx": "Shows detailed information about a past trade analysis, including inputs, results, and computed metrics.",
  "frontend/src/components/history/HistoryPanel.tsx": "Fetches and displays trade analysis history with loading, error, empty states, and detail view navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication state and actions.",
  "frontend/src/hooks/useMarketData.ts": "Manages market data fetch state with loading, error handling, and reset functionality.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating queries are organized elsewhere.",
  "frontend/src/hooks/useTradeAnalysis.ts": "Provides a React Query mutation to analyze a trade via the actor and refreshes trade history on success.",
  "frontend/src/hooks/useTradeHistory.ts": "Fetches full trade history and individual trades using React Query with actor validation and graceful error handling.",
  "frontend/src/hooks/useUserProfile.ts": "Retrieves and saves the caller’s user profile using React Query, with cache invalidation on save.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/csv/parsePriceCsv.ts": "Parses CSV price data into typed objects with validation and error collection, then sorts by date.",
  "frontend/src/lib/indicators.ts": "Computes SMA, support, resistance, and indicator bundles from price data or market data points.",
  "frontend/src/lib/marketData/config.ts": "Stores configuration and notes for the Alpha Vantage market data provider.",
  "frontend/src/lib/marketData/deriveTradeInputs.ts": "Generates default entry, stop-loss, and take-profit levels from market data and indicators.",
  "frontend/src/lib/marketData/fetchMarketData.ts": "Fetches intraday or fallback daily market data from Alpha Vantage with input validation and error handling.",
  "frontend/src/lib/marketData/types.ts": "Defines types for price points, market data results, and market data errors.",
  "frontend/src/lib/session.ts": "Manages a disclaimer acknowledgment flag using sessionStorage.",
  "frontend/src/lib/tradeMath.ts": "Provides utility functions for computing profit/loss and formatting currency and percentages.",
  "frontend/src/lib/validation.ts": "Validates required fields and numeric input with optional positivity checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using URL search and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "JSON file describing the project’s current state, requirements, issues, and feature definitions for a stock-analysis web app."
}