{
  "backend/main.mo": "Main Motoko actor implementing trade analysis backend with user profiles, trade calculations (position size, risk/reward ratio), trade history storage, and access control integration using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence fixes for rate-limit retry loop issues in useMarketData.ts and marketDataClient.ts, including proper backoff scheduling, attempt tracking, and timeout logic.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, utilities, and configuration, describing market data fetching, trade analysis, CSV upload, authentication, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for a trading-themed interface with sidebar, charts, and UI component tokens.",
  "frontend/index.html": "HTML entry point for the Trade Setup Analyzer application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with tabbed interface for trade analysis, featuring live market data fetching with comprehensive error handling, form validation, auto-population from market data, CSV upload integration, and optional diagnostic panel.",
  "frontend/src/components/auth/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states. Clears the query cache on logout and handles authentication errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal dialog that prompts authenticated users to enter their name for profile setup. Cannot be dismissed and saves the profile using the useSaveCallerUserProfile hook.",
  "frontend/src/components/CsvUploadPanel.tsx": "CSV upload component that parses historical price data, computes technical indicators, converts between PriceData and PricePoint formats, and invokes onDataLoaded callback with processed data and indicators.",
  "frontend/src/components/DiagnosticPanel.tsx": "A collapsible debug panel component that displays market data diagnostics including last request/response details, cache statistics, and retry history. Uses shadcn/ui components and accepts DiagnosticData as props.",
  "frontend/src/components/DisclaimerGate.tsx": "A modal dialog component that displays a trading disclaimer on first visit, requiring users to check a box acknowledging educational purpose and risks before accessing the app. Uses session storage to track acknowledgment.",
  "frontend/src/components/history/HistoryDetail.tsx": "Displays detailed view of a single trade analysis including input parameters, analysis results, and calculated profit/loss metrics. Provides a back button to return to the history list.",
  "frontend/src/components/history/HistoryPanel.tsx": "Displays a scrollable list of saved trade analyses with loading, error, and empty states. Clicking an item navigates to HistoryDetail view.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance, handling both authenticated and anonymous modes. Initializes access control with admin token and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMarketData.ts": "React hook for managing market data fetch state with retry logic, cooldown timers, rate limit handling, and diagnostic support for debugging.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating queries are organized in feature-specific hooks elsewhere.",
  "frontend/src/hooks/useTradeAnalysis.ts": "React Query mutation hook for analyzing trades by calling the backend actor with trade parameters (ticker, prices, risk amount) and invalidating trade history on success.",
  "frontend/src/hooks/useTradeHistory.ts": "React Query hooks for fetching trade history list and individual trades by ID from the backend actor, with empty array fallback for no history.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the current user's profile via the backend actor, with query invalidation on save.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including background, foreground, primary, secondary, and chart colors.",
  "frontend/src/lib/csv/parsePriceCsv.ts": "CSV parser for price data that extracts date, OHLC prices, and volume from CSV text, validates data, handles errors, and returns sorted price data.",
  "frontend/src/lib/indicators.ts": "Technical indicator calculations including SMA (Simple Moving Average), support/resistance levels from price data, with adapters for both raw and market data formats.",
  "frontend/src/lib/marketData/config.ts": "Configuration for Alpha Vantage market data API including base URL, demo API key, rate limits (5/min, 25/day), and API key validation utilities.",
  "frontend/src/lib/marketData/deriveTradeInputs.ts": "Derives default trade input values (entry, stop loss, take profit) from market data and technical indicators using support/resistance or percentage-based fallbacks.",
  "frontend/src/lib/marketData/fetchMarketData.ts": "Fetches intraday stock price data from Alpha Vantage API with validation, error handling, and rate limit detection. Parses time series data into PricePoint arrays and returns MarketDataResult or MarketDataError.",
  "frontend/src/lib/marketData/marketDataClient.ts": "Client wrapper for market data fetching with in-memory caching, request de-duplication, automatic retry with exponential backoff, and diagnostic tracking. Manages request state and enforces minimum intervals between API calls per ticker.",
  "frontend/src/lib/marketData/marketDataPolicy.ts": "Defines centralized policy constants for market data operations including cache TTL (60s), request spacing (5s), and exponential backoff parameters. Provides utility functions for ticker normalization and backoff delay calculation.",
  "frontend/src/lib/marketData/types.ts": "TypeScript type definitions for market data including PricePoint, MarketDataResult, MarketDataError, and error code enums. Defines the data structures used throughout the market data fetching system.",
  "frontend/src/lib/session.ts": "Manages disclaimer acknowledgment state in sessionStorage with getter and setter functions. Provides safe access with error handling for environments without sessionStorage.",
  "frontend/src/lib/tradeMath.ts": "Utility functions for trade calculations including potential profit/loss computation and formatting helpers for currency and percentage display.",
  "frontend/src/lib/urlParams.ts": "Simple utilities for reading URL query parameters from window.location.search. Provides functions to get and check for specific URL parameters.",
  "frontend/src/lib/validation.ts": "Input validation utilities for required fields and numeric inputs with optional positive value constraints. Returns validation error messages or null for valid inputs.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers. Renders the main App component with necessary context providers.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities supporting both regular query strings and hash-based routing with sessionStorage persistence. Includes functions for extracting, storing, and clearing parameters from URLs and session storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and typography/container-queries plugins. Defines design tokens for colors, spacing, fonts, and animations.",
  "project_state.json": "Project state tracking for a stock analysis web app that fetches live market data by ticker and proposes trade setups. Currently experiencing rate-limit and data-fetching issues with the market data API that need investigation and fixing."
}