{
  "backend/main.mo": "Main Motoko actor implementing trade analysis backend with user profiles, trade calculations (position size, risk/reward ratio), trade history storage per user, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for Yahoo Finance integration error handling, including comprehensive error logging, URL validation, CORS/network error detection, and UI error message display.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files covering authentication, trade analysis, market data fetching with error handling, CSV upload, technical indicators, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables optimized for financial data visualization with trading-themed aesthetics.",
  "frontend/index.html": "HTML entry point for the Trade Setup Analyzer React application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application component orchestrating authentication, user profile setup, trade analysis form with market data auto-population, CSV upload integration, history panel, and comprehensive error display with diagnostic mode.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout, managing authentication state and clearing query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile by entering their name, with validation and error handling for profile creation.",
  "frontend/src/components/CsvUploadPanel.tsx": "React component for uploading CSV price data files, parsing OHLCV format, computing technical indicators, and triggering callbacks with PricePoint-formatted data for trade input auto-population.",
  "frontend/src/components/DiagnosticPanel.tsx": "Collapsible diagnostic panel component that displays market data request details, cache state, retry history, and environment information for debugging purposes.",
  "frontend/src/components/DisclaimerGate.tsx": "Modal dialog component that displays a legal disclaimer about educational use and trading risks, requiring user acknowledgment via checkbox before accessing the application.",
  "frontend/src/components/history/HistoryDetail.tsx": "Detailed view component for a single trade analysis, displaying input parameters, calculated results, and potential profit/loss metrics with navigation back to history list.",
  "frontend/src/components/history/HistoryPanel.tsx": "Panel component that displays a list of saved trade analyses with loading states, error handling, and navigation to detailed views of individual trades.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling both authenticated and anonymous actors, and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMarketData.ts": "React hook for managing market data fetch state with retry logic, cooldown timers, rate limit handling, and diagnostic support for debugging.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating queries are organized in feature-specific hooks elsewhere.",
  "frontend/src/hooks/useTradeAnalysis.ts": "React Query mutation hook for analyzing trades via the backend actor, accepting trade parameters and invalidating trade history on success.",
  "frontend/src/hooks/useTradeHistory.ts": "React Query hooks for fetching trade history list and individual trades by ID from the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the current user's profile via the backend actor with cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including chart colors and design tokens.",
  "frontend/src/lib/csv/parsePriceCsv.ts": "CSV parser for price data files, extracting date, OHLC, and volume columns with validation and error reporting.",
  "frontend/src/lib/indicators.ts": "Technical indicator calculations including SMA, support, and resistance levels from price data or market data price points.",
  "frontend/src/lib/marketData/config.ts": "Configuration constants for Yahoo Finance API including base URL, rate limits, and usage notes.",
  "frontend/src/lib/marketData/deriveTradeInputs.ts": "Derives default trade entry, stop loss, and take profit values from market data and technical indicators using conservative defaults.",
  "frontend/src/lib/marketData/fetchMarketData.ts": "Fetches intraday price data from Yahoo Finance API with comprehensive error handling, timeout control, environment detection, and verbose debug logging.",
  "frontend/src/lib/marketData/marketDataClient.ts": "Client-side market data wrapper implementing caching (60s TTL), request de-duplication, rate-limit spacing (2s minimum interval), and automatic retry with exponential backoff for failed requests. Includes diagnostic tracking for cache hits/misses and request/response details.",
  "frontend/src/lib/marketData/marketDataPolicy.ts": "Centralized policy constants for market data fetching: 60s cache TTL, 2s minimum request interval, 3 max retries with 5-30s exponential backoff. Provides ticker normalization and backoff delay calculation utilities.",
  "frontend/src/lib/marketData/types.ts": "TypeScript type definitions for market data: MarketDataResult (price points, ticker, timestamp, provider), MarketDataError (error codes including rate_limit, invalid_ticker, network_error, etc.), and PricePoint (OHLCV data).",
  "frontend/src/lib/session.ts": "Session storage utilities for tracking disclaimer acknowledgment state using sessionStorage with 'trade_analyzer_disclaimer_acknowledged' key.",
  "frontend/src/lib/tradeMath.ts": "Trade calculation utilities: computes potential profit/loss from entry/exit prices and position size, and provides currency/percentage formatting functions.",
  "frontend/src/lib/urlParams.ts": "Simple URL query parameter utilities for reading and checking URL parameters from window.location.search.",
  "frontend/src/lib/validation.ts": "Input validation utilities for required fields and numeric inputs with optional positive-value enforcement, returning error messages or null.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), typography, container queries, animations (accordion), and custom font families (Inter, JetBrains Mono).",
  "project_state.json": "Project state document describing a stock analysis web app that should fetch live market data by ticker, with known issues around rate limiting, retry logic, and Yahoo Finance provider failures. Includes architectural notes on rate-limit mitigation and existing features for trade analysis, CSV upload, and user history."
}