{
  "kind": "build_request",
  "title": "Fix infinite rate-limit retry loop",
  "projectName": "Trade Setup Analyzer",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Fix the rate-limit retry loop in frontend/src/hooks/useMarketData.ts so it stops repeating the same 'rate limit reached, retrying in 1s...' message indefinitely. Ensure the retry logic respects the exponential backoff schedule (10s, 30s, 60s) and stops after reaching the maximum retry attempts (3) instead of looping forever.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "rate limit reached,  retrying in 1s...it keep repeating that message"
        ]
      },
      "acceptanceCriteria": [
        "The retry message updates with increasing delays (10s, 30s, 60s) instead of always showing '1s'",
        "After 3 failed attempts, the retry loop stops and shows a final error state",
        "The cooldown timer in the UI reflects the actual backoff delay from the policy",
        "No infinite retry loops occur when rate limits are hit"
      ]
    },
    {
      "id": "REQ-22",
      "text": "Update the retry state management in frontend/src/lib/marketData/marketDataClient.ts to correctly track and increment the current attempt count across retries, and ensure the backoff delay calculation uses the actual attempt number rather than a fixed value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ]
      },
      "acceptanceCriteria": [
        "The retry attempt counter increments correctly (0, 1, 2, 3)",
        "Each retry uses the backoff delay corresponding to its attempt number",
        "Diagnostic data shows accurate retry history with correct attempt numbers and delays"
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add timeout logic to frontend/src/hooks/useMarketData.ts so that if the retry loop exceeds a maximum total duration (e.g., 2 minutes), it exits gracefully with a clear error message indicating that retries have been exhausted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ]
      },
      "acceptanceCriteria": [
        "If retries continue beyond 2 minutes total, the loop terminates",
        "A clear error message is shown: 'Rate limit retries exhausted. Please try again later.'",
        "The user can manually trigger a new fetch attempt after the timeout"
      ]
    }
  ],
  "constraints": [
    "Do not modify the exponential backoff policy constants in frontend/src/lib/marketData/marketDataPolicy.ts",
    "Preserve existing rate-limit detection logic in frontend/src/lib/marketData/fetchMarketData.ts"
  ],
  "nonGoals": [
    "Changing the Alpha Vantage API provider or switching to a different data source",
    "Modifying the maximum retry limit or backoff delays",
    "Adding user controls to configure retry behavior"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}