{
  "kind": "build_request",
  "title": "Analyze ticker using live market data and auto-populate trade inputs",
  "projectName": "Trade Setup Analyzer",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Add live market data fetching for a user-entered ticker symbol so the app can retrieve recent price history and a latest price (when available) from an external market-data HTTP endpoint, without requiring the user to manually type current price / swing levels.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "YES, PLEASE...make sure it's analyzing live stock data"
        ]
      },
      "acceptanceCriteria": [
        "When a user enters a ticker and triggers data fetch, the UI shows a loading state and then displays fetched live/latest price and a timestamp (or clearly indicates when only last-close data is available).",
        "If the ticker is invalid or the market-data request fails, the UI shows a clear error message in English and does not overwrite existing user-entered values.",
        "The market-data provider endpoint used by the app is clearly indicated in code as a single configurable base URL (not scattered across components)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Derive analysis inputs automatically from the fetched live market data: compute recent support/resistance (or recent swing low/high) from the fetched OHLC/close series using the existing indicator computation approach, and use those derived values to auto-populate the trade parameter fields (entry/stop/take-profit) so the user is no longer required to supply these numbers manually.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-7"
        ],
        "quotes": [
          "THIS IS ALL WRONG, THE INFO ITS ASKING ME FOR, THE APP IS SUPPOSE TO BE GIVING ME THAT INFO FROM ANALYZING THE STOCK THAT I INPUT",
          "YES, PLEASE...make sure it's analyzing live stock data"
        ]
      },
      "acceptanceCriteria": [
        "After successful live-data fetch, the app auto-fills Entry Price, Stop Loss, and Take Profit with derived values (and keeps Ticker filled).",
        "Auto-filled values are clearly labeled as derived from live market data and remain editable (user can override).",
        "Derived levels are computed from the fetched series (not from placeholder constants) and are consistent with the existing indicator logic (e.g., using recent min/max over a lookback window)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the analyze flow so the primary action uses the live-data-derived inputs by default: running an analysis after a successful live-data fetch should send the derived (or user-overridden) entry/stop/take-profit values and the user-entered risk amount to the existing backend analysis endpoint, and the results UI should continue to work unchanged.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "YES, PLEASE...make sure it's analyzing live stock data"
        ]
      },
      "acceptanceCriteria": [
        "If live data has been fetched, clicking “Analyze Trade Setup” runs analysis using the current values shown in the input fields (derived by default, overridden if the user edited them).",
        "If live data has not been fetched yet, the UI guides the user to fetch live data (or otherwise provides a clear path to proceed) rather than silently analyzing with empty/invalid values.",
        "Successful analysis still saves to per-user history and the History tab continues to load past analyses without errors."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add a small live-data status panel in the Analyzer tab that shows: data source label, last refresh time, and a manual “Refresh Data” control to re-fetch live market data for the currently entered ticker.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "YES, PLEASE...make sure it's analyzing live stock data"
        ]
      },
      "acceptanceCriteria": [
        "The status panel is visible when a ticker is present and indicates one of: not fetched yet / loading / fetched successfully / error.",
        "“Refresh Data” re-runs the fetch and updates derived values while preserving the user’s risk amount input.",
        "User-facing strings are in English and consistent with the app’s existing tone."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep Motoko backend logic in the single existing actor (backend/main.mo). Add backend methods there only if needed; do not introduce additional backend services.",
    "Do not introduce third-party authentication providers; keep Internet Identity as-is."
  ],
  "nonGoals": [
    "Real-time streaming quotes (e.g., websockets) and sub-second price updates.",
    "Paid market data integrations requiring API keys (unless the user later supplies keys/endpoints).",
    "Guaranteeing accuracy, completeness, or timeliness of external market data; the UI should surface limitations via status/timestamps instead."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}