{
  "kind": "build_request",
  "title": "Diagnose and fix market data fetch failures",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Add comprehensive logging to the market data fetch pipeline in frontend/src/lib/marketData/fetchMarketData.ts and frontend/src/lib/marketData/marketDataClient.ts to capture: raw API response status, response body, parsed result or error type, cache hits/misses, retry attempts, and backoff delays. Log at debug level so issues can be diagnosed without exposing sensitive data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "the app is having trouble fetching the data. can you fix it..."
        ]
      },
      "acceptanceCriteria": [
        "Console logs show the full request/response flow for each market data fetch attempt",
        "Error messages include the specific failure reason (network, API error, parse failure, rate limit)",
        "Cache behavior is visible in logs (hit/miss, TTL remaining)"
      ]
    },
    {
      "id": "REQ-17",
      "text": "Validate that the Alpha Vantage API key is correctly loaded from frontend/src/lib/marketData/config.ts and that the constructed request URL matches the provider's expected format. Add a fallback error message if the API key is missing or malformed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "API key presence is checked before making requests",
        "User sees a clear error message if the API key is missing or invalid",
        "Request URL construction is logged for verification"
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add error recovery logic in frontend/src/hooks/useMarketData.ts to handle common failure modes: network timeouts (increase fetch timeout or add retry), unexpected response formats (log the raw response and show a user-friendly error), and missing or empty data arrays (show 'No data available for this ticker').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Network timeouts trigger automatic retry with exponential backoff",
        "Unexpected response formats are logged and display a clear error to the user",
        "Empty or missing data shows a specific 'No data available' message instead of a generic error"
      ]
    },
    {
      "id": "REQ-19",
      "text": "Improve error display in frontend/src/App.tsx to show more specific guidance based on the error type returned by useMarketData: rate limit errors show cooldown timer and retry info, invalid ticker errors suggest checking the symbol, network errors prompt the user to check connectivity, and API errors display the provider's message if available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Rate limit errors display the cooldown timer and next retry time",
        "Invalid ticker errors suggest verifying the symbol",
        "Network errors include connectivity troubleshooting guidance",
        "API-specific errors show the provider's error message when available"
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add a developer-friendly diagnostic mode (enabled via URL parameter ?debug=market-data) that exposes: last request details, raw API response, cache state, retry history, and backoff schedule in a collapsible panel at the bottom of the Analyzer tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Appending ?debug=market-data to the URL enables the diagnostic panel",
        "Panel shows last request URL, response status, raw response body, and error details",
        "Cache state (entries, TTL, hits/misses) is visible",
        "Retry history and backoff schedule are displayed"
      ]
    }
  ],
  "constraints": [
    "Do not modify backend/main.mo; market data fetching is entirely frontend-side",
    "Preserve existing rate-limit handling logic and retry mechanism in marketDataClient.ts",
    "Do not expose the Alpha Vantage API key in logs or error messages"
  ],
  "nonGoals": [
    "Switching to a different market data provider",
    "Adding user-configurable API keys",
    "Implementing server-side data fetching or caching"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}