{
  "kind": "build_request",
  "title": "Mitigate live market-data API rate limits with caching and automatic backoff",
  "projectName": "Trade Setup Analyzer",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Add client-side caching for live market-data fetches so repeated requests for the same ticker within a short time window reuse the last successful result instead of calling the external API again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "IT SAYS API LIMIT HAS BEEN REACHED",
          "OK LETS TRY THAT OPTION"
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks “Fetch Live Data” multiple times for the same ticker within the cache TTL, only the first click performs a network request; subsequent clicks return cached data.",
        "Cached entries are keyed at least by normalized ticker symbol (trimmed + uppercased) and include a stored fetch timestamp.",
        "The cache TTL is configurable in code (a single constant) and defaults to a sensible short duration (e.g., ~60 seconds) to reduce rate-limit hits while still allowing refreshes.",
        "Cache behavior does not break existing derived-input auto-population or analysis flow."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Implement request de-duplication and minimum request spacing for live market-data fetches so the app cannot trigger multiple overlapping calls or burst requests that exceed the provider’s per-minute limit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "IT SAYS API LIMIT HAS BEEN REACHED",
          "OK LETS TRY THAT OPTION"
        ]
      },
      "acceptanceCriteria": [
        "If a fetch for a ticker is already in-flight, additional fetch attempts while loading do not create a second network request (they either await the same promise or no-op).",
        "The app enforces a minimum interval between actual network calls per ticker (separate from caching), preventing rapid consecutive requests from the UI from generating bursts.",
        "The UI “Fetch Live Data” and “Refresh” controls remain disabled while a request is in-flight, as they are today, and the underlying logic also prevents duplicate calls."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add automatic retry with exponential backoff when the market-data provider responds with a rate-limit response (e.g., Alpha Vantage 'Note'/'Information') and expose a clear, user-facing cooldown state indicating when the next retry will occur.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "IT SAYS API LIMIT HAS BEEN REACHED",
          "OK LETS TRY THAT OPTION"
        ]
      },
      "acceptanceCriteria": [
        "When the provider indicates a rate limit was reached, the app schedules an automatic retry using exponential backoff (with a maximum retry count and maximum delay).",
        "During the backoff/cooldown window, the UI displays an English message indicating the app is waiting to retry (e.g., “Rate limit reached. Retrying in 20s…”).",
        "Manual refresh/fetch controls are disabled during the cooldown window to prevent additional rate-limit hits, and re-enabled after success or after retries are exhausted.",
        "If retries are exhausted, the app shows an English error message that explains the rate limit and suggests waiting or trying again later; it does not get stuck in a loading state."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Improve market-data error typing so the UI can distinguish rate-limit errors from other errors (invalid ticker, network error, no data) and render more specific guidance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "IT SAYS API LIMIT HAS BEEN REACHED",
          "OK LETS TRY THAT OPTION"
        ]
      },
      "acceptanceCriteria": [
        "Market-data error results include a machine-readable indicator for rate-limited responses (e.g., a boolean flag or an error code) without breaking existing call sites.",
        "Non-rate-limit errors continue to show the current error UI, but rate-limit errors use the new cooldown/retry UX and messaging.",
        "Invalid ticker handling remains unchanged (still shows an immediate validation-style error without retry/backoff)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under frontend/src/components/ui or any path listed in frontend.immutablePaths.",
    "Backend must remain single-actor; do not introduce additional backend services or external databases.",
    "Use English for all user-facing text.",
    "Do not remove or rename the existing Alpha Vantage configuration values (baseUrl/provider/apiKey) in frontend/src/lib/marketData/config.ts; extend safely if needed."
  ],
  "nonGoals": [
    "Switching to a different market-data provider or adding paid API key management UI.",
    "Adding WebSockets or real-time streaming quotes.",
    "Moving market-data fetching to a separate backend service (the platform is single-backend-actor and external DBs are not supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}