{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix infinite rate-limit retry loop",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Fix the rate-limit retry loop in useMarketData.ts to correctly display exponential backoff delays and stop after maximum retries instead of looping infinitely",
      "acceptanceCriteria": [
        "The retry message updates with increasing delays (10s, 30s, 60s) instead of always showing '1s'",
        "After 3 failed attempts, the retry loop stops and shows a final error state",
        "The cooldown timer in the UI reflects the actual backoff delay from the policy",
        "No infinite retry loops occur when rate limits are hit"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMarketData.ts",
          "operation": "modify",
          "description": "Fix retry state management to properly track attempt counts and display correct backoff delays. Update the cooldownRemaining calculation to use the actual backoff delay from the policy instead of a hardcoded 1-second value. Ensure the retry loop terminates after maxRetries (3) is reached by checking the attempt count before scheduling the next retry. Add logic to transition to a final error state when retries are exhausted, preventing infinite loops."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Update retry state management in marketDataClient.ts to correctly track and increment attempt counts, ensuring backoff delays are calculated from the actual attempt number",
      "acceptanceCriteria": [
        "The retry attempt counter increments correctly (0, 1, 2, 3)",
        "Each retry uses the backoff delay corresponding to its attempt number",
        "Diagnostic data shows accurate retry history with correct attempt numbers and delays"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/marketData/marketDataClient.ts",
          "operation": "modify",
          "description": "Fix the retry logic in fetchWithRetry to properly track and increment the currentAttempt counter across retry cycles. Ensure the backoff delay calculation in the retry loop uses the incremented attempt number (currentAttempt + 1) rather than currentAttempt, so that the first retry uses delay[0], second uses delay[1], etc. Update diagnostic tracking to record accurate attempt numbers and corresponding delays in the retry history."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add timeout logic to useMarketData.ts to gracefully exit the retry loop if total duration exceeds 2 minutes, displaying a clear error message",
      "acceptanceCriteria": [
        "If retries continue beyond 2 minutes total, the loop terminates",
        "A clear error message is shown: 'Rate limit retries exhausted. Please try again later.'",
        "The user can manually trigger a new fetch attempt after the timeout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMarketData.ts",
          "operation": "modify",
          "description": "Add a maximum total duration check (2 minutes) to the retry loop. Track the elapsed time from the initial fetch attempt and terminate the retry loop if the total duration exceeds 120 seconds. When the timeout is reached, set the error state to 'Rate limit retries exhausted. Please try again later.' and reset the fetching state to allow the user to manually trigger a new fetch attempt."
        }
      ]
    }
  ]
}